app/Services/ClientService.php

    public function getClientWithAchats(int $clientId, array $filters = [], int $page = 1, int $perPage = 10): array
    {
        $client = $this->clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`deleted_at` IS NULL
AND `clients`.`id` = 2