app/Controllers/Api/DlcController.php

    public function calculer()
    {
        try {
            $data = $this->request->getJSON(true);

            if (!isset($data['produit_id']) || !isset($data['date_creation'])) {
                return $this->response->setStatusCode(400)
                    ->setJSON(['error' => 'produit_id et date_creation requis']);
            }

            $produit_id = (int) $data['produit_id'];
            $date_creation = $data['date_creation'];

            $model = new ProduitModel();
            $produit = $model->find($produit_id);
---
SELECT *
FROM `produits`
WHERE `produits`.`deleted_at` IS NULL
AND `produits`.`id` = 3