app/Models/MouvementModel.php

SELECT COUNT(*) AS `numrows`
FROM `mouvements`
JOIN `produits` ON `produits`.`id` = `mouvements`.`produit_id`
WHERE `mouvements`.`client_id` = 2
AND `mouvements`.`type` = 'sortie'
AND `mouvements`.`cause` = 'vente'
AND `mouvements`.`deleted_at` IS NULL
SELECT `mouvements`.*, `produits`.`nom` as `produit_nom`, `produits`.`prix_vente`
FROM `mouvements`
JOIN `produits` ON `produits`.`id` = `mouvements`.`produit_id`
WHERE `mouvements`.`client_id` = 2
AND `mouvements`.`type` = 'sortie'
AND `mouvements`.`cause` = 'vente'
AND `mouvements`.`deleted_at` IS NULL
ORDER BY `mouvements`.`date_mouvement` DESC
 LIMIT 10
---
    public function getAchatsClient(int $clientId, array $filters = [], int $page = 1, int $perPage = 10): array
    {
        $builder = $this->db->table('mouvements')
            ->select('mouvements.*, produits.nom as produit_nom, produits.prix_vente')
            ->join('produits', 'produits.id = mouvements.produit_id')
            ->where('mouvements.client_id', $clientId)
            ->where('mouvements.type', 'sortie')
            ->where('mouvements.cause', 'vente')
            ->where('mouvements.deleted_at', null);

        // Appliquer les filtres de dates
        if (!empty($filters['date_debut'])) {
            $builder->where('mouvements.date_mouvement >=', $filters['date_debut']);
        }
        if (!empty($filters['date_fin'])) {
            $builder->where('mouvements.date_mouvement <=', $filters['date_fin']);
        }

        // Compter le total
        $total = $builder->countAllResults(false);

        // Récupérer la page
        $data = $builder->orderBy('mouvements.date_mouvement', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();