app/Models/MouvementModel.php

    public function getMouvements(array $filters = [], int $page = 1, int $perPage = 10): array
    {
        $builder = $this->db->table('mouvements')
            ->select('mouvements.*, produits.nom as produit_nom, clients.nom as client_nom')
            ->join('produits', 'produits.id = mouvements.produit_id', 'left')
            ->join('clients', 'clients.id = mouvements.client_id', 'left')
            ->where('mouvements.deleted_at', null);

        $this->applyMouvementFilters($builder, $filters);

        $total = $builder->countAllResults(false);

        $data = $builder->orderBy('mouvements.date_mouvement', 'DESC')
                        ->orderBy('mouvements.id', 'DESC')
                        ->limit($perPage, ($page - 1) * $perPage)
                        ->get()
                        ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `mouvements`
LEFT JOIN `produits` ON `produits`.`id` = `mouvements`.`produit_id`
LEFT JOIN `clients` ON `clients`.`id` = `mouvements`.`client_id`
WHERE `mouvements`.`deleted_at` IS NULL
AND `mouvements`.`date_mouvement` >= '2026-07-31'
AND `mouvements`.`date_mouvement` <= '2026-08-28'
AND `mouvements`.`produit_id` = '1'
SELECT `mouvements`.*, `produits`.`nom` as `produit_nom`, `clients`.`nom` as `client_nom`
FROM `mouvements`
LEFT JOIN `produits` ON `produits`.`id` = `mouvements`.`produit_id`
LEFT JOIN `clients` ON `clients`.`id` = `mouvements`.`client_id`
WHERE `mouvements`.`deleted_at` IS NULL
AND `mouvements`.`date_mouvement` >= '2026-07-31'
AND `mouvements`.`date_mouvement` <= '2026-08-28'
AND `mouvements`.`produit_id` = '1'
ORDER BY `mouvements`.`date_mouvement` DESC, `mouvements`.`id` DESC
 LIMIT 10

    public function getChartData(array $filters = []): array
    {
        $builder = $this->db->table('mouvements')
            ->select("
                DATE(date_mouvement) as date,
                SUM(CASE WHEN type = 'entree' THEN quantite ELSE 0 END) as entree,
                SUM(CASE WHEN type = 'sortie' THEN quantite ELSE 0 END) as sortie
            ")
            ->where('mouvements.deleted_at', null);

        $this->applyMouvementFilters($builder, $filters);

        $builder->groupBy('DATE(date_mouvement)')
                ->orderBy('date', 'ASC');

        $results = $builder->get()->getResultArray();
---
SELECT DATE(date_mouvement) as date, SUM(CASE WHEN type = 'entree' THEN quantite ELSE 0 END) as entree, SUM(CASE WHEN type = 'sortie' THEN quantite ELSE 0 END) as sortie
FROM `mouvements`
WHERE `mouvements`.`deleted_at` IS NULL
AND `mouvements`.`date_mouvement` >= '2026-07-31'
AND `mouvements`.`date_mouvement` <= '2026-08-29'
GROUP BY DATE(date_mouvement)
ORDER BY `date` ASC

public function getAchatsClient(int $clientId, array $filters = [], int $page = 1, int $perPage = 10): array
{
    $builder = $this->db->table('mouvements')
        ->select('mouvements.*, produits.nom as produit_nom, produits.prix_vente')
        ->join('produits', 'produits.id = mouvements.produit_id')
        ->where('mouvements.client_id', $clientId)
        ->where('mouvements.type', 'sortie')
        ->where('mouvements.cause', 'vente')
        ->where('mouvements.deleted_at', null);
---
SELECT SUM(mouvements.quantite * produits.prix_vente) as total
FROM `mouvements`
JOIN `produits` ON `produits`.`id` = `mouvements`.`produit_id`
WHERE `mouvements`.`client_id` = 2
AND `mouvements`.`type` = 'sortie'
AND `mouvements`.`cause` = 'vente'
AND `mouvements`.`deleted_at` IS NULL